{"pageProps":{"id":"git-team","contentHtml":"<p>Through all these years that I’ve spent working in the IT industry, I learned\nthat very often technology is not the answer to your problems. The issue that\npeople try to solve with new and shiny tools usually can be solved by improving\na process or introducing some good practices. Don’t get me wrong, I love tools\nand I think they can help a lot, but they are not a silver bullet or some kind\nof a magic remedy.</p>\n<p>In addition to using tools, I’ve also learnt to look at them from a different\nperspective - as a source of inspiration for patterns, flows and solutions that\nI could apply in non-technical parts of my work. Thanks to that, sometimes I\nrealize that processes and workflows can be organized in the same way as in a\nspecific tool.</p>\n<h2>Technology is not the answer… but IT has the answer</h2>\n<p>My latest “epiphany” was about modelling work in my team after\n<a href=\"https://git-scm.com/\">Git</a>.</p>\n<p>Despite its flaws and quirks, for me, Git is the most awesome tool that I have\nhad a chance to learn during my time in the IT industry. I’m still amazed by its\npower and how it is simple and complicated at the same time. And how it’s free,\nand how most of the world of software development runs on it. Simply amazing!</p>\n<p>Ok, now you know that I love this tool, but what does it have to do with\norganizing work in a team?</p>\n<p>Let me start explaining the whole idea by giving you some context.</p>\n<h2>Too small to fail, too big to succeed</h2>\n<p>My current team, which is definitely the best one I’ve ever worked in, is 5\npeople - a director and 4 individual contributors (IC).<br>\nWe are a distributed team - three ICs are based in Poland and one IC and the\ndirector are based in the USA. On top of that, except for one IC, everyone works\nfrom home. It means that we do a lot of work asynchronously. Even ICs in Poland,\nwho are in the same time zone, have different working hours due to their\nprofessional and private responsibilities, such as meetings with other teams in\ndifferent time zones in the afternoon or evening, taking care of their families\nor attending to their private matters.</p>\n<p>We wanted our work to be both efficient and comfortable. But we noticed we were\nneglecting some of the things that would make it so. We needed someone to remind\nothers about things we agreed on, to keep an eye on the Jira backlog, to record\nour decisions, to make sure all user support requests are taken care of, etc.</p>\n<p>However, the idea of having a manager that would be a proxy between the director\nand the ICs didn’t seem reasonable given the size of our team.</p>\n<p>I thought we were in a pickle, but then it hit me. Technology has the answer!</p>\n<h2>We are distributed like… Git!</h2>\n<p>If a tool can work efficiently in a distributed model, the team can as well. We\nare human beings, not pieces of software, but we need structures, processes and\nrules to work efficiently.</p>\n<h3>Everyone owns the team</h3>\n<p>When you work with Git, you usually have the following setup.</p>\n<p><img src=\"git-repos-diagram.png\" alt=\"Diagram showing remote and local Git repos\"></p>\n<p>The remote repository is a central repository that is shared among team members.\nIt’s usually hosted on a platform like GitHub, Bitbucket or GitLab.<br>\nA local repository is a full copy of the remote repository. It’s hosted on a\nmachine of an individual user.</p>\n<p>When I looked at this model, it struck me that basically our team is like Git .</p>\n<p>The remote repository is the team itself. It’s the most important part and\neveryone contributes to it.</p>\n<p>The hierarchy among ICs is flat - we don’t have a leader or a manager. Apart\nfrom official titles and seniority grades, we are all equal. Everyone has the\nsame rights and obligations. We could say that everyone has the same stake in\nthe team. Therefore, everyone has the exact same local copy of the remote\nrepository.</p>\n<p><img src=\"team-members-diagram.png\" alt=\"Diagram showing team and its members. It has the same structure as the diagram showing git repos\"></p>\n<p>A local repository allows you to work independently. Even if the central\nrepository is offline or inaccessible, you can continue to work on your local\ncopy and then push your changes to the central repository when you have access\nto it again.</p>\n<p>It’s the same with our team. We are spread across different locations and time\nzones so throughout the week we don’t have many occasions to interact with one\nanother. We do our work according to our schedules and then we synchronize with\none another (push and pull our changes to the central repository) when we have a\nmeeting, exchange messages on Slack or have a quick call.</p>\n<h3>Repos have branches, teams have domains</h3>\n<p>In our team, we share our technical and non-technical responsibilities equally.\nEvery domain has its owner. For example, one person is the owner of backend\ntechnology, supporting users and making sure that we record our work in Jira.\nBeing the owner of a domain doesn't mean that you do all the tasks related to\nit. Instead, you make sure that all work in this domain is done on time.</p>\n<p>Each domain in our team is like a feature branch in Git. The branch owner makes\nsure everything in their branch is on track but can share work with other team\nmembers. When the owner delegates a task to a colleague, they create a\nsub-branch off the feature branch. These sub-branches represent individual tasks\nthat team members handle, merging their contributions back into the feature\nbranch and then by extension to the main branch.</p>\n<p>Owners of feature branches also collaborate when their work overlaps and they\nmerge changes between their branches. This ensures that all work fits together\nwell. In the end, all the work from the feature branches and their sub-branches\nis merged into the central repository.</p>\n<h3>What about the director?</h3>\n<p>Of course, the director’s role differs from roles of ICs but the general idea of\nowning the team equally and having certain responsibilities still apply. He\ndevelops his feature branches and contributes to the central repository like\neveryone else by dealing with the team operations on a higher level, being an\ninterface to other teams, making sure the team achieve their goals and that they\nare headed in the right direction.</p>\n<p>The only difference is that being a director gives him additional privileges\nthat he can use if needed. For example, if a merge conflict happens and it\ncannot be resolved automatically, the director will drive the manual resolution.\nBut even then, it’s never solely his decision which conflicted change wins. He\ndoesn’t simply overwrite an IC’s change and force push to the central\nrepository. He always seeks to pick the resolution that’s best for the team.</p>\n<h2>Best practices</h2>\n<p>Every tool has best practices for using it. They are meant to guide you how you\nshould use certain features to achieve a specific result or to avoid potential\nissues. The sole fact that a feature is available doesn’t mean you should use it\nall the time. Git is no different.</p>\n<h3>With great power comes great responsibility</h3>\n<p>For example, you cannot push your changes to the central repository if the\nhistory is not in sync between your local repository and the remote repository.\nBut you can use the\n<a href=\"https://git-scm.com/docs/git-push#Documentation/git-push.txt---force\"><code>–force</code></a>\noption to overwrite the history without any checks. It’s a powerful option but\nit can cause many issues. Therefore, if you work on a branch with other people,\nyou shouldn’t force push. Same goes for working with your team members. If you\nshare a responsibility with other people, you should align, communicate and make\ndecisions together. You don’t force your point of view on them and overwrite\ntheir decisions without talking to them first.</p>\n<h3>Why did I do it?</h3>\n<p>Centralized systems, like Subversion, store a separate history for each file in\na repository. Git is a distributed version control system so it stores history\nas a graph of snapshots of the entire repository because it needs to have access\nto the “full story” all the time. This comes in handy, especially when your\ncommit messages are detailed and informative. When you need to remind yourself\nwhat you did, when and why, you check the log of changes.</p>\n<p>You should do the same in your team - record decisions and rules you agreed\nupon, take meeting notes, maintain internal documentation, etc. In a distributed\nteam this type of history is invaluable. You can always refer to a source and\nget information that you need while your teammates who are experts in a\nparticular area are fast asleep. Also, you can remind yourself why 6 months ago\nyou decided to do something that now doesn’t make sense.</p>\n<h3>Communication is key</h3>\n<p>In Git, you should commit and push often. That way your teammates know what\nyou’re up to at all times. I think it’s a bad practice to work on something\nlocally for a long time and to not share your work. The later you get feedback\nfrom your peers, the worse the consequences may be. Imagine that you were asked\nto implement a new feature in an app. After you developed it for 2 months\nwithout sharing your code with anyone, someone finally had a look at it and told\nyou that you misunderstood a basic requirement. If you had shared your work on a\nregular basis, you wouldn’t have wasted so much time (and money).</p>\n<p>Same goes for your team. Sync with your teammates often. I’ve learnt throughout\nmy career that communication is the key to success, especially in a distributed\nteam. When you don’t work in the same physical location, sometimes you should\neven <strong>over</strong>communicate. I would compare it to audio descriptions. When you\nwork in a distributed team, you need to put in some extra effort to inform\nothers what is going on because they can’t see what you are doing.</p>\n<p>It takes practice to communicate well the same way it takes practice to make\ngood commit messages. In both cases, it’s not enough to do it often. Your\nmessages must be clear, informative and to the point. Otherwise, you will create\ntoo much noise that won’t serve anyone.</p>\n<h3>Mark your milestones</h3>\n<p>In Git, you can use <a href=\"https://git-scm.com/book/en/v2/Git-Basics-Tagging\">tagging</a>\nto mark important points in the history of your codebase. This feature is often\nused for marking software releases.</p>\n<p>In your team, you should also mark checkpoints. For example, you can divide the\nplan for a fiscal year into quarters and then mark a checkpoint when each\nquarter ends. This way you will be able to analyze the history of your team\noperations and see clearly what was done at specific points in time.</p>\n<h3>This one feature is off limits</h3>\n<p>I'm a huge fan of Git, but there's one thing that shouldn't be copied as a good\npractice to your team - <a href=\"https://git-scm.com/docs/git-blame\"><code>git blame</code></a>.\nDon’t get me wrong, the team must be aware of their issues and who or what\ncaused them. I just think that the name of this feature isn't fortunate.</p>\n<p>In my team, we don't blame one another, mostly because we don't have to.\nInstead, we try to create a safe environment where everyone feels comfortable to\nadmit openly to their mistakes, even before others discover them. We don't hide\nthat we broke something and always inform others proactively about issues that\nmay result from our actions. Very often, we even joke about our screwups. Our\nhealthy work environment removes the need to blame others because everyone takes\ncare of blaming themselves really well.</p>\n<h2>What’s next?</h2>\n<p>If you buy the analogy that I presented in this article and you think that the\nGit model would work for you, don't wait. Just\n<a href=\"https://git-scm.com/docs/git-init\"><code>git init</code></a> your team.</p>\n","title":"Organize your team like Git","episodeId":null,"description":"This article aims to show how you can use concepts from Git, a distributed version control system, to organize your team.","author":"Michał Skowron"},"__N_SSG":true}