{"pageProps":{"episodeData":{"title":"#80 Tech Writer sprzedaje wartość swojej pracy, czyli jak wytłumaczyć szefostwu technikalia","description":"<p>Cały rok pracujesz w pocie czoła w przekonaniu, że Twoja praca ma sens i generuje wartość dla firmy. Zapewne masz rację, ale nie oznacza to, że osoby usytuowane wyżej w hierarchii są tego świadome i rozumieją złożoność tego z czym musisz się mierzyć na co dzień. Dlatego szefostwo organizuje wszelkiej maści spotkania i prezentacje, szczególnie na koniec roku fiskalnego, które są dla Ciebie niepowtarzalną szansą na przedstawienie swojego bogatego dorobku.</p><p>Rozmawiamy o tym jak pokazać przełożonym wartość swojej pracy, tak żeby po 5 minutach nie stracili zainteresowania, na ile głęboko powinniśmy wchodzić w szczegóły techniczne i jakie cyferki mają znaczenie. W pierwszej części omawiamy wspomniane zagadnienia z punktu widzenia Doc Tools Developera, a w drugiej z punktu widzenia Tech Writera.</p><p><em>Dźwięki wykorzystane w audycji pochodzą z kolekcji \"107 Free Retro Game Sounds\" dostępnej na stronie <a href=\"https://dominik-braun.net\" target=\"_blank\">https://dominik-braun.net</a>, udostępnianej na podstawie licencji Creative Commons license CC BY 4.0 (<a href=\"https://creativecommons.org/licenses/by/4.0/\" target=\"_blank\">https://creativecommons.org/licenses/by/4.0/</a>).</em></p>\n","blurb":"Cały rok pracujesz w pocie czoła w przekonaniu, że Twoja praca ma sens i generuje wartość dla firmy. Zapewne masz rację, ale nie oznacza to, że osoby usytuowane","pubDate":"Mon, 28 Jul 2025 05:58:53 GMT","anchorLink":"https://podcasters.spotify.com/pod/show/docdeveloper/episodes/80-Tech-Writer-sprzedaje-warto-swojej-pracy--czyli-jak-wytumaczy-szefostwu-technikalia-e3644j5","audioUrl":"https://anchor.fm/s/8afba9c/podcast/play/106090533/https%3A%2F%2Fd3ctxlq1ktw2nl.cloudfront.net%2Fstaging%2F2025-6-28%2Fa0c1b04a-9952-fc47-f482-bb9f59def608.mp3","episodeNumber":80,"episodeLink":"/blog/2025/7/28/80","duration":"00:42:30"}},"__N_SSG":true}